In [44]:
import pandas as pd
import warnings
import psycopg2
warnings.filterwarnings('ignore')

In [54]:
try: 
    pg_conn = psycopg2.connect(
        host="localhost",
        database="uber_de",
        user="postgres", 
        password="Clarence2023!"
    )
    pg_conn.autocommit = True
    print("Connection to PG successful!")
except psycopg2.Error as e:
    print("Connection error:",e)

cursor = pg_conn.cursor()

Connection to PG successful!

In [28]:
df = pd.read_parquet(r'D:\My Project\DE_uber\Dataset\yellow_tripdata_2022-10.parquet')
df = df.head(30000)

In [29]:
df.columns

Index(['VendorID', 'tpep_pickup_datetime', 'tpep_dropoff_datetime',
       'passenger_count', 'trip_distance', 'RatecodeID', 'store_and_fwd_flag',
       'PULocationID', 'DOLocationID', 'payment_type', 'fare_amount', 'extra',
       'mta_tax', 'tip_amount', 'tolls_amount', 'improvement_surcharge',
       'total_amount', 'congestion_surcharge', 'airport_fee'],
      dtype='object')

In [30]:
df = df.drop_duplicates().reset_index(drop=True)
df['trip_id'] = df.index

In [31]:
df['tpep_dropoff_datetime'] = pd.to_datetime(df['tpep_dropoff_datetime'])
df['tpep_pickup_datetime'] = pd.to_datetime(df['tpep_pickup_datetime'])

datetime_dim = df[['tpep_pickup_datetime', 'tpep_dropoff_datetime']]
datetime_dim['pick_hour'] = datetime_dim['tpep_pickup_datetime'].dt.hour
datetime_dim['pick_day'] = datetime_dim['tpep_pickup_datetime'].dt.day
datetime_dim['pick_month'] = datetime_dim['tpep_pickup_datetime'].dt.month
datetime_dim['pick_year'] = datetime_dim['tpep_pickup_datetime'].dt.year
datetime_dim['pick_weekday'] = datetime_dim['tpep_pickup_datetime'].dt.weekday

datetime_dim['drop_hour'] = datetime_dim['tpep_dropoff_datetime'].dt.hour
datetime_dim['drop_day'] = datetime_dim['tpep_dropoff_datetime'].dt.day
datetime_dim['drop_month'] = datetime_dim['tpep_dropoff_datetime'].dt.month
datetime_dim['drop_year'] = datetime_dim['tpep_dropoff_datetime'].dt.year
datetime_dim['drop_weekday'] = datetime_dim['tpep_dropoff_datetime'].dt.weekday

datetime_dim['datetime_id'] = datetime_dim.index

datetime_dim = datetime_dim[['datetime_id', 'tpep_pickup_datetime', 'tpep_dropoff_datetime', 'pick_hour', 'pick_day', 'pick_month', 'pick_year', 'pick_weekday', 'drop_hour', 'drop_day', 'drop_month', 'drop_year', 'drop_weekday']]
datetime_dim.head()

,datetime_id,tpep_pickup_datetime,tpep_dropoff_datetime,pick_hour,pick_day,pick_month,pick_year,pick_weekday,drop_hour,drop_day,drop_month,drop_year,drop_weekday
0,0,2022-10-01 00:03:41,2022-10-01 00:18:39,0,1,10,2022,5,0,1,10,2022,5
1,1,2022-10-01 00:14:30,2022-10-01 00:19:48,0,1,10,2022,5,0,1,10,2022,5
2,2,2022-10-01 00:27:13,2022-10-01 00:37:41,0,1,10,2022,5,0,1,10,2022,5
3,3,2022-10-01 00:32:53,2022-10-01 00:38:55,0,1,10,2022,5,0,1,10,2022,5
4,4,2022-10-01 00:44:55,2022-10-01 00:50:21,0,1,10,2022,5,0,1,10,2022,5

In [32]:
passenger_count_dim = df[['passenger_count']].drop_duplicates().reset_index(drop=True)
passenger_count_dim['passenger_count_id']  = passenger_count_dim.index
passenger_count_dim = passenger_count_dim[['passenger_count_id','passenger_count']]
passenger_count_dim

   passenger_count_id  passenger_count
0                   0              1.0
1                   1              2.0
2                   2              0.0
3                   3              3.0
4                   4              4.0
5                   5              5.0
6                   6              6.0

In [33]:
trip_distance_dim = df[['trip_distance']].drop_duplicates().sort_values('trip_distance').reset_index(drop=True)
trip_distance_dim['trip_distance_id'] = trip_distance_dim.index
trip_distance_dim = trip_distance_dim[['trip_distance_id', 'trip_distance']]
trip_distance_dim

      trip_distance_id  trip_distance
0                    0           0.00
1                    1           0.01
2                    2           0.02
3                    3           0.03
4                    4           0.04
...                ...            ...
1916              1916          44.22
1917              1917          45.76
1918              1918          49.43
1919              1919          49.83
1920              1920          61.82

[1921 rows x 2 columns]

In [34]:
rate_code_dict = {
    1: "Standard Rate",
    2: "JFK",
    3: "Newark",
    4: "Nassau or Westchester",
    5: "Negotiated Fare",
    6: "Group Ride"
}

rate_code_dim = df[['RatecodeID']].drop_duplicates().reset_index(drop=True)
rate_code_dim['rate_code_id'] = rate_code_dim.index
rate_code_dim['rate_code_name'] = rate_code_dim['RatecodeID'].map(rate_code_dict)
rate_code_dim = rate_code_dim[['rate_code_id', 'RatecodeID', 'rate_code_name']]
rate_code_dim

   rate_code_id  RatecodeID         rate_code_name
0             0         1.0          Standard Rate
1             1         5.0        Negotiated Fare
2             2         4.0  Nassau or Westchester
3             3         2.0                    JFK
4             4         3.0                 Newark
5             5        99.0                    NaN
6             6         6.0             Group Ride

In [35]:
payment_method_dic ={
    1: "Credit Card",
    2: "Cash",
    3: "No Charge",
    4: "Dispute",
    5: "Unknown", 
    6: "Voided Trip"
}
payment_method_dim  = df[['payment_type']].drop_duplicates().reset_index(drop=True)
payment_method_dim['payment_method_id'] = payment_method_dim.index
payment_method_dim['payment_type_name'] = payment_method_dim['payment_type'].map(payment_method_dic)
payment_method_dim = payment_method_dim[['payment_method_id', 'payment_type', 'payment_type_name']]
payment_method_dim

   payment_method_id  payment_type payment_type_name
0                  0             1       Credit Card
1                  1             2              Cash
2                  2             4           Dispute
3                  3             3         No Charge

In [36]:
location_dic = pd.read_csv(r'D:\My Project\DE_uber\Dataset\taxi+_zone_lookup.csv')
location_dic.head()

   LocationID        Borough                     Zone service_zone
0           1            EWR           Newark Airport          EWR
1           2         Queens              Jamaica Bay    Boro Zone
2           3          Bronx  Allerton/Pelham Gardens    Boro Zone
3           4      Manhattan            Alphabet City  Yellow Zone
4           5  Staten Island            Arden Heights    Boro Zone

In [37]:
pickup_location_dim = df[['PULocationID']].drop_duplicates().sort_values('PULocationID').reset_index(drop=True)
pickup_location_dim['pickup_location_id'] = pickup_location_dim.index
pickup_location_dim['pickup_borough'] = pickup_location_dim['PULocationID'].map(location_dic.set_index('LocationID')['Borough'])
pickup_location_dim['pickup_zone'] = pickup_location_dim['PULocationID'].map(location_dic.set_index('LocationID')['Zone'])
pickup_location_dim['pickup_service_zone'] = pickup_location_dim['PULocationID'].map(location_dic.set_index('LocationID')['service_zone'])
pickup_location_dim.head()

,PULocationID,pickup_location_id,pickup_borough,pickup_zone,pickup_service_zone
0,1,0,EWR,Newark Airport,EWR
1,3,1,Bronx,Allerton/Pelham Gardens,Boro Zone
2,4,2,Manhattan,Alphabet City,Yellow Zone
3,7,3,Queens,Astoria,Boro Zone
4,10,4,Queens,Baisley Park,Boro Zone

In [38]:
dropoff_location_dim = df[['DOLocationID']].drop_duplicates().sort_values('DOLocationID').reset_index(drop=True)
dropoff_location_dim['dropoff_location_id'] = dropoff_location_dim.index
dropoff_location_dim['dropoff_borough'] = dropoff_location_dim['DOLocationID'].map(location_dic.set_index('LocationID')['Borough'])
dropoff_location_dim['dropoff_zone'] = dropoff_location_dim['DOLocationID'].map(location_dic.set_index('LocationID')['Zone'])
dropoff_location_dim['dropoff_service_zone'] = dropoff_location_dim['DOLocationID'].map(location_dic.set_index('LocationID')['service_zone'])
dropoff_location_dim.head()

,DOLocationID,dropoff_location_id,dropoff_borough,dropoff_zone,dropoff_service_zone
0,1,0,EWR,Newark Airport,EWR
1,3,1,Bronx,Allerton/Pelham Gardens,Boro Zone
2,4,2,Manhattan,Alphabet City,Yellow Zone
3,6,3,Staten Island,Arrochar/Fort Wadsworth,Boro Zone
4,7,4,Queens,Astoria,Boro Zone

In [39]:
fact_table = df.merge(passenger_count_dim, on='passenger_count') \
            .merge(trip_distance_dim, on='trip_distance') \
            .merge(rate_code_dim, on='RatecodeID') \
            .merge(pickup_location_dim, on='PULocationID') \
            .merge(dropoff_location_dim, on='DOLocationID') \
            .merge(datetime_dim, on='tpep_dropoff_datetime') \
            .merge(payment_method_dim, on='payment_type') \
[['VendorID', 'datetime_id', 'passenger_count_id', 'trip_distance_id', 'rate_code_id', 'pickup_location_id', 'dropoff_location_id', 'payment_method_id',
  'store_and_fwd_flag', 'fare_amount', 'extra','mta_tax', 'tip_amount', 'tolls_amount', 'improvement_surcharge',
    'total_amount', 'congestion_surcharge', 'airport_fee']]

fact_table.head()

,VendorID,datetime_id,passenger_count_id,trip_distance_id,rate_code_id,pickup_location_id,dropoff_location_id,payment_method_id,store_and_fwd_flag,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount,congestion_surcharge,airport_fee
0,1,0,0,169,0,164,94,0,N,9.5,3.00,0.5,2.65,0.0,0.3,15.95,2.5,0.00
1,1,394,0,169,0,164,94,0,N,9.5,3.00,0.5,2.65,0.0,0.3,15.95,2.5,0.00
2,1,0,0,814,0,88,206,0,N,24.5,4.25,0.5,0.00,0.0,0.3,29.55,2.5,1.25
3,1,394,0,814,0,88,206,0,N,24.5,4.25,0.5,0.00,0.0,0.3,29.55,2.5,1.25
4,1,5812,0,169,0,164,94,0,N,9.0,3.00,0.5,1.00,0.0,0.3,13.80,2.5,0.00

In [58]:
from sqlalchemy import create_engine

engine = create_engine('postgresql://postgres:Clarence20231@localhost:5432/uber_de')
fact_table.to_sql("fact_table", engine, if_exists='replace', index=False)

68